uhnp/src/InformationRegisters/ПолномочияКатегорийныхМенеджеров/ПолномочияКатегорийныхМенеджеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПолномочияКатегорийныхМенеджеров</name>
  <resources>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТоварнаяКатегория</name>
    <type>
      <types>CatalogRef.КатегорииЗакупок</types>
      <types>CatalogRef.ТоварныеКатегории</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ПолномочияКатегорийныхМенеджеров/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
// Возвращает массив товарных категорий, сопоставленных менеджеру ПользовательВход
// в организации ОрганизацияВход.
Функция ПолучитьТоварныеКатегорииПоМенеджеру(ПользовательВход, ОрганизацияВход) Экспорт
	РезультатФункции = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ПолномочияКатегорийныхМенеджеров.ТоварнаяКатегория КАК ТоварнаяКатегория
		|ИЗ
		|	РегистрСведений.ПолномочияКатегорийныхМенеджеров КАК ПолномочияКатегорийныхМенеджеров
		|ГДЕ
		|	ПолномочияКатегорийныхМенеджеров.Менеджер = &Менеджер
		|	И ПолномочияКатегорийныхМенеджеров.Организация В(&Организация)
		|	И ТИПЗначения(ПолномочияКатегорийныхМенеджеров.ТоварнаяКатегория) = ТИП(Справочник.КатегорииЗакупок)";
	Запрос.УстановитьПараметр("Менеджер", ПользовательВход);
	Запрос.УстановитьПараметр("Организация", ОрганизацияВход);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РезультатФункции.Добавить(ВыборкаДетальныеЗаписи.ТоварнаяКатегория);
	КонецЦикла;
	РезультатФункции = ОбщегоНазначенияКлиентСервер.СвернутьМассив(РезультатФункции);
	РезультатФункции = ОбщегоНазначенияКлиентСерверУХ.УдалитьПустыеЭлементыМассива(РезультатФункции);
	РезультатФункции = ОбщегоНазначенияКлиентСерверУХ.СортироватьМассив(РезультатФункции);
	Возврат РезультатФункции;
КонецФункции		 // ПолучитьТоварныеКатегорииПоМенеджеру()
	
#КонецЕсли
